ansible-slides.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>ansible 4 vagrant</title>
<meta name="author" content="glenn opdycke-hansen"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/sky.css" id="theme"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/reveal.js/3.0.0/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">ansible 4 vagrant</h1><h2 class="author">glenn opdycke-hansen</h2><p class="date">Created: 2019-03-21 Thu 07:35</p>
</section>

<section>
<section id="slide-orgc59e8fb">
<h2 id="orgc59e8fb">Motivation</h2>
<ul>
<li>Ansible use case is to deploy an application after a build.</li>
<li>The build is executed first which can take 10-20 minutes</li>
<li>Changes in the ansible code are slowed due to the build timing.</li>
<li>Need a way to quickly run the ansible code in order to test changes.</li>

</ul>
</section>
</section>
<section>
<section id="slide-org970b877">
<h2 id="org970b877">First Option: Ansible from Vagrant</h2>
<p>
Vagrant supports provision of VM via ansible
</p>
</section>
<section id="slide-org3924a66">
<h3 id="org3924a66">Installs</h3>
<div class="outline-text-3" id="text-org3924a66">
</div>
</section>
<section id="slide-org36a5e56">
<h4 id="org36a5e56">Install Ansible</h4>
<ul>
<li>Ansible Installation Guild contains the instructions to install the control machine</li>
<li>See <a href="https://docs.ansible.com/ansible/latest/installation_guide/intro_installation.html">ansible install guide</a></li>
<li id="Check version"><code>ansible --version</code></li>

</ul>

</section>
<section id="slide-org67dda4c">
<h4 id="org67dda4c">Install Vagrant</h4>
<blockquote>
<p>
Vagrant is utility for managing the lifecycle of virtual machines
</p>
</blockquote>

<ul>
<li>To install vagrant, see <a href="https://www.vagrantup.com/docs/installation/">vagrant installation</a></li>
<li>Vagrant allows you to start virtual machines.</li>
<li>It also can provision the VM with Ansible</li>

</ul>

<div class="org-src-container">

<pre><code class="" python >config.vm.provision "ansible" do |ansible|
  ansible.playbook = "playbook.yml"
end
</code></pre>
</div>

<dl>
<dt>vagrant version</dt><dd><code>vagrant --version</code></dd>

</dl>

</section>
<section id="slide-org2e3cb00">
<h4 id="org2e3cb00">Install Virtualbox</h4>
<blockquote>
<p>
VirtualBox is a virtualizer for x86 hardware
</p>
</blockquote>

<ul>
<li>Install package from <a href="https://www.virtualbox.org/wiki/Downloads">VirtualBox Downloads</a>
<dl>
<dt>virtualbox version</dt><dd>virtualbox &#x2013;version</dd>

</dl></li>

</ul>

</section>
<section id="slide-org7d685a3">
<h3 id="org7d685a3">Setup</h3>
<ul>
<li>Create directory for the project, eg, <b><b>ansible4vagrant</b></b></li>
<li>List the vagrant boxes</li>

</ul>
<pre  class="example">
vagrant box list
</pre>

<ul>
<li>Add Vagrant box for centos/7 - downloads vm image</li>

</ul>
<pre  class="example">
vagrant box add centos/7
</pre>

<ul>
<li>Init Vagrantfile for Centos v7 box for vagrant with command:</li>

</ul>
<pre  class="example">
vagrant init centos/7
</pre>

</section>
<section id="slide-org0ad5ab3">
<h3 id="org0ad5ab3">Vagrant Start/Test/End</h3>
<ul>
<li>Start/add/boot Centos vm</li>

</ul>
<pre  class="example">
vagrant up
</pre>
<ul>
<li>Check status of vm</li>

</ul>
<pre  class="example">
vagrant status
</pre>
<ul>
<li>provision vm with ansible</li>

</ul>
<pre  class="example">
vagrant provision
</pre>
<ul>
<li>SSH to vm</li>

</ul>
<pre  class="example">
vagrant ssh
</pre>
<ul>
<li>Shutdown vm</li>

</ul>
<pre  class="example">
vagrant halt
</pre>
</section>
<section id="slide-orgb617456">
<h3 id="orgb617456">Vagrant Reload/Provision</h3>
<ul>
<li>how to shutdown, startup VM</li>

</ul>
<pre  class="example">
vagrant reload
</pre>
<ul>
<li>how to execute the ansible script</li>

</ul>
<pre  class="example">
vagrant provision
</pre>

</section>
</section>
<section>
<section id="slide-org81386d6">
<h2 id="org81386d6">Adding Testinfra to Vagrant/Ansible</h2>
<ul>
<li>Use Vagrant Provision/execute Ansible scripts</li>
<li>Add py.test tests that are executed by Testinfra</li>
<li>Branch: <a href="https://github.com/glennoph/ansible4vagrant/tree/ansible-replace-tokens-role-testinfra">https://github.com/glennoph/ansible4vagrant/tree/ansible-replace-tokens-role-testinfra</a></li>

</ul>
</section>
<section id="slide-org2c2a5c8">
<h3 id="org2c2a5c8">Installs</h3>
<div class="outline-text-3" id="text-org2c2a5c8">
</div>
</section>
<section id="slide-org1d743d7">
<h4 id="org1d743d7">Install Testinfra</h4>
<dl>
<dt>Install</dt><dd>`pip install testinfra`</dd>
<dt>Current Version</dt><dd>2.0.0</dd>
<dt>Check version</dt><dd>`testinfra &#x2013;version`</dd>

</dl>
</section>
<section id="slide-orgb56b587">
<h3 id="orgb56b587">Test Example</h3>
<dl>
<dt>file</dt><dd>test infra.py</dd>

</dl>

<pre  class="example">
# test_infra.py
def test_passwd_file(host):
    passwd = host.file("/etc/passwd")
    assert passwd.contains("root")
    assert passwd.user == "root"
</pre>

</section>
<section id="slide-org774dbe1">
<h3 id="org774dbe1">test execution</h3>
<dl>
<dt>file</dt><dd>tests setup.sh</dd>

</dl>

<pre  class="example">
echo 'save ssh config'
vagrant ssh-config &gt; .vagrant/ssh-config

echo 'run tests with hosts default'
py.test --hosts=default --ssh-config=.vagrant/ssh-config tests/test_vagrant.py
</pre>

</section>
<section id="slide-org92d244c">
<h3 id="org92d244c">Test Vagrant</h3>
<div class="outline-text-3" id="text-org92d244c">
</div>
</section>
<section id="slide-org4de66ee">
<h4 id="org4de66ee">test setup</h4>
<dl>
<dt>file</dt><dd>`tests-vagrant.sh`</dd>

</dl>

<pre  class="example">
echo 'save ssh config'
vagrant ssh-config &gt; .vagrant/ssh-config

echo 'run tests with hosts default'
py.test --hosts=default --ssh-config=.vagrant/ssh-config tests/tests-vagrant.py
</pre>

</section>
<section id="slide-org8925298">
<h4 id="org8925298">test</h4>
<dl>
<dt>file</dt><dd>`tests/test<sub>vagrant.py</sub>`</dd>

</dl>

<pre  class="example">
# test_vagrant.py

def test_datafile1(host):
    datafile1_file = host.file('/data/file1.properties')
    assert datafile1_file.exists
    assert datafile1_file.is_file
    assert datafile1_file.contains('token') == False
</pre>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/head.min.js"></script>
<script src="https://cdn.jsdelivr.net/reveal.js/3.0.0/js/reveal.js"></script>
<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
mouseWheel: false,
fragmentInURL: false,
pdfSeparateFragments: true,

overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }]
});
</script>
</body>
</html>
